app/controllers/listings_controller.rb

  def index
    @listings = Listing.all.order("created_at DESC")
---
SELECT "listings".* FROM "listings"   ORDER BY created_at DESC

  def create
    @listing = Listing.new(listing_params)
    @listing.user_id = current_user.id


    respond_to do |format|
      if @listing.save
---
INSERT INTO "listings" ("created_at", "description", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-06-25 07:20:35.476263"], ["description", "An"], ["name", "A"], ["price", 5.0], ["updated_at", "2014-06-25 07:20:35.476263"]]

  def update
    respond_to do |format|
      if @listing.update(listing_params)
---
UPDATE "listings" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "listings"."id" = 10  [["image_file_name", "IMG_20140618_162255.jpg"], ["image_file_size", 1067487], ["image_updated_at", "2014-06-28 12:31:49.228339"], ["updated_at", "2014-06-28 12:31:50.069254"]]