app/controllers/orders_controller.rb

def sales
    @orders = Order.all.where(seller: current_user).order("created_at DESC")
---
SELECT "orders".* FROM "orders"  WHERE "orders"."seller_id" = 3  ORDER BY created_at DESC

  def purchases
    @orders = Order.all.where(buyer: current_user).order("created_at DESC")
---
SELECT "orders".* FROM "orders"  WHERE "orders"."buyer_id" = 3  ORDER BY created_at DESC

  def new
    @order = Order.new
    @listing = Listing.find(params[:listing_id])
---
SELECT  "listings".* FROM "listings"  WHERE "listings"."id" = ? LIMIT 1  [["id", 14]]

  def create
    @order = Order.new(order_params)
    @listing = Listing.find(params[:listing_id])
    @seller = @listing.user

    @order.listing_id = @listing.id
    @order.buyer_id = current_user.id
    @order.seller_id = @seller.id

     Stripe.api_key = ENV["STRIPE_API_KEY"]
    token = params[:stripeToken]

    begin
      charge = Stripe::Charge.create(
        :amount => (@listing.price * 100).floor,
        :currency => "usd",
        :card => token
        )
---
SELECT  "listings".* FROM "listings"  WHERE "listings"."id" = ? LIMIT 1  [["id", 14]]
INSERT INTO "orders" ("address", "city", "created_at", "state", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", "Fake Street"], ["city", "Los Angeles"], ["created_at", "2014-07-01 10:35:11.399588"], ["state", "California"], ["updated_at", "2014-07-01 10:35:11.399588"]]